Repository: fpiantini/jokettt_tbot
Catalog: jokettttbot/locale/*/LC_MESSAGES/messages.po
Languages: it_it

source: Hello
it_it: Ciao

source: Use keyboard to play, or digit /help for help
it_it: Usa la tastiera per giocare, o scrivi /help per la schermata di aiuto

source: A telegram bot that plays Tic-tac-toe
it_it: Un bot telegram che gioca a Tris

source: Commands
it_it: Comandi

source: /help - Print help informations
it_it: /help - Stampa queste info

source: /info - Print program informations
it_it: /info - Stampa informazioni sul programma

source: /p - Print current board status
it_it: /p - Visualizza lo stato corrente della scacchiera

source: /n - Start a new game
it_it: /n - Inizia una nuova partita

source: /m - Pass the move to the AI (only first move)
it_it: /m - Passa la mossa alla AI (solo se siamo alla prima mossa)

source: /minimax - Set the AI to minimax and restart game
it_it: /minimax - Imposta la AI in modalità 'minimax' (giocatore imbattibile)

source: /learner - Set the AI to learner and restart game
it_it: /learner - Imposta la AI in modalità 'learner' (giocatore che impara)

source: How to play
it_it: Come giocare

source: When its your turn, enter the move with the custom keyboard, or entering text with the following format:
it_it: Al tuo turno, entra la mossa usando la tastiera sotto, o scrivendo la mossa usando il seguente formato:

source: where [R] is the row where to place the pawn, and [C] is the column.
it_it: dove [R] è la riga dove vuoi mettere la pedina, e [C] la colonna.

source: Rows are A, B and C starting from top, and columns are 1, 2 and 3 starting from left.
it_it: Le righe sono A, B e C partendo dall'alto, e le colonne sono 1, 2 e 3 partendo da sinistra.

source: For example, enter 'A1' to place a pawn on upper left corner.
it_it: Per esempio, scrivi 'A1' per mettere una pedina nell'angolo in alto a sinistra.

source: After your move, I will do my move, and the board status will be printed.
it_it: Dopo la tua mossa, io farò la mia e quindi lo stato della tastiera sarà stampato.

source: If the game is ended the result is printed.
it_it: Se la partita è terminata, stamperò il risultato.

source: --- New game. My move ---
it_it: --- Nuova partita. Muovo io ---

source: --- New game. Awaiting you move ---
it_it: --- Nuova partita. Mossa a te ---

source: Ok, I move
it_it: Ok, muovo io

source: Your move...
it_it: Tocca a te...

source: Game already started, cannot change order of players
it_it: Partita già iniziata, non posso cambiare l'ordine dei giocatori

source: Your move:
it_it: La tua mossa:

source: Invalid move:
it_it: Mossa non valida:

source: My move:
it_it: La mia mossa:

source: You lose! :-D
it_it: Hai perso! :-D

source: You win!! :-(
it_it: Hai vinto!! :-(

source: Draw! ;-)
it_it: Patta! ;-)
